Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/c-api.tmx
Source language: en
Languages: pl

source: The return value (*rv*) for these functions should be interpreted as follows:
pl: Wartość zwracana (z ang. - return value) *wr* ( z ang. - *rv*) dla tych zadań powinna być rozumiana następująco:

source: When ``0 <= rv < size``, the output conversion was successful and *rv* characters were written to *str* (excluding the trailing ``'\0'`` byte at *str*[*rv*]).
pl: Gdy ``0 <= rv < size``, konwersja wyjściowa została zakończona powodzeniem i znaki *rv* zostały zapisane do ciągu znaków *str* (pomijając kończący znak ``'\0'`` w *str*[*rv*]).

source: When ``rv >= size``, the output conversion was truncated and a buffer with ``rv + 1`` bytes would have been needed to succeed. *str*[*size*-1] is ``'\0'`` in this case.
pl: Gdy ``rv >= size``, wynikowa podmiana została ucięta i wymiennik z ``rv + 1`` kęsami byłby potrzebny do zakończenia powodzeniem. znak *str*[*rozmiar*-1] jest znakiem ``'\0'`` w tym przypadku.

source: When ``rv < 0``, "something bad happened." *str*[*size*-1] is ``'\0'`` in this case too, but the rest of *str* is undefined. The exact cause of the error depends on the underlying platform.
pl: Gdy ``rv < 0``, "stało się coś złego." *str*[*size*-1] jest znakiem ``'\0'`` także w tym przypadku, ale reszta ciągu *str* jest nieokreślona. Dokładna przyczyna błędu zależy od leżącego u podstaw systemu.

source: The following functions provide locale-independent string to number conversions.
pl: Następujące zadania dostarczają niezależne od ustawień regionalnych ciągi do zamian liczb.

source: DateTime Objects
pl: Przedmioty Daty-Czasu (z ang. - DateTime)

source: Various date and time objects are supplied by the :mod:`datetime` module. Before using any of these functions, the header file :file:`datetime.h` must be included in your source (note that this is not included by :file:`Python.h`), and the macro :cmacro:`PyDateTime_IMPORT` must be invoked, usually as part of the module initialisation function. The macro puts a pointer to a C structure into a static variable, :cdata:`PyDateTimeAPI`, that is used by the following macros.
pl: Różne przedmioty daty i czasu są dostarczane przez moduł :mod:`datetime`. Przed użyciem którychkolwiek z tych zadań, plik nagłówkowy :file:`datetime.h` musi zostać załączony do źródeł (zauważ że nie jest to załączone w pliku :file:`Python.h`), i makropolecznie :cmacro:`PyDateTime_IMPORT` powinno zostać wywołane, zwykle jako część zadania inicjującego moduł. Makropolecenie wstawia wskaźnik do struktury języka C do zmiennej statycznej, :cdata:`PyDateTimeAPI`, które jest używane przez następujące makropolecenia.

source: Type-check macros:
pl: Makropolecenia sprawdzenia typu:

source: Macros to create objects:
pl: Makropolecenia do tworzenia przedmiotów:

source: Macros to extract fields from date objects. The argument must be an instance of :cdata:`PyDateTime_Date`, including subclasses (such as :cdata:`PyDateTime_DateTime`). The argument must not be *NULL*, and the type is not checked:
pl: Makropolecenia do wydobywania elementów daty. Parametr musi być przedstawicielem :cdata:`PyDateTime_Date`, zawierając podklasy (takie jak: :cdata:`PyDateTime_DateTime`). Parametr nie może być *NULL*, i typ nie jest sprawdzany:

source: Macros to extract fields from datetime objects. The argument must be an instance of :cdata:`PyDateTime_DateTime`, including subclasses. The argument must not be *NULL*, and the type is not checked:
pl: Makropolecenia do wydobywania elementów z przedmiotu daty. Parametr musi być przedstawicielem :cdata:`PyDateTime_DateTime`, włączając podklasy. Parametr nie może być *NULL*, i typ nie jest sprawdzany:

source: Macros to extract fields from time objects. The argument must be an instance of :cdata:`PyDateTime_Time`, including subclasses. The argument must not be *NULL*, and the type is not checked:
pl: Makropolecenia do wydobywania elementów z przedmiotu czasu. Parametr musi być przedstawicielem :cdata:`PyDateTime_Time`, włączając podklasy. Parametr nie może być pusty *NULL*, a jego typ nie jest sprawdzany:

source: Macros for the convenience of modules implementing the DB API:
pl: Makropolecenia dla wygody modułów realizujących sprzęg programowania baz danych DB API:

source: Descriptor Objects
pl: Przedmioty Deskryptorów

source: "Descriptors" are objects that describe some attribute of an object. They are found in the dictionary of type objects.
pl: "Deskryptory" są przedmiotami które opisują niektóre własności przedmiotu. Można je znaleźć w słowniku przedmiotów typów.

source: Dictionary Objects
pl: Przedmioty Słownikowe

source: Exception Handling
pl: Obsługa sytuacji wyjątkowych

source: The functions described in this chapter will let you handle and raise Python exceptions. It is important to understand some of the basics of Python exception handling. It works somewhat like the Unix :cdata:`errno` variable: there is a global indicator (per thread) of the last error that occurred. Most functions don't clear this on success, but will set it to indicate the cause of the error on failure. Most functions also return an error indicator, usually *NULL* if they are supposed to return a pointer, or ``-1`` if they return an integer (exception: the :cfunc:`PyArg_\*` functions return ``1`` for success and ``0`` for failure).
pl: Zadania opisane w tym rozdziale pozwalają obsługiwać i zgłaszać sytuacje wyjątkowe języka pytonowskiego. Istotne jest pojęcie pewnych podstaw obsługi sytuacji wyjątkowych języka Pytonowskiego. Działa ono trochę, jak zmienna znana z systemu Unix :cdata:`errno`: istnieje ogólnego poziomu wskaźnik (po jednym na wątek) ostatniego błędu który wystąpił. Większość zadań nie wyczyszcza tego przy bezbłędnym wykonaniu, ale ustawia go aby wskazywał na powód błędu przy jego wystąpieniu. Większość zadań zwraca także wskazanie błędu, zwykle *NULL* jeśli miały zwrócić wskaźnik, lub ``-1`` jeśli zwracają liczbę całkowitą (z wyjątkiem: zadań :cfunc:`PyArg_\*` które zwracają ``1`` przy pozytywnym wykonaniu i ``0`` przy błędnym zakończeniu).

source: When a function must fail because some function it called failed, it generally doesn't set the error indicator; the function it called already set it. It is responsible for either handling the error and clearing the exception or returning after cleaning up any resources it holds (such as object references or memory allocations); it should *not* continue normally if it is not prepared to handle the error. If returning due to an error, it is important to indicate to the caller that an error has been set. If the error is not handled or carefully propagated, additional calls into the Python/C API may not behave as intended and may fail in mysterious ways.
pl: Gdy zadanie musi zawieźć z powodu błędu zadania które wywołało, ogólnie nie ustawia ona wskaźnika błędu; podzadanie które zostało wywołane już go ustawiła. Jest on odpowiedzialny albo za obsługę błędu i wyczyszczenie wskaźnika sytuacji wyjątkowej lub powrót po sprzątnięciu jakichkolwiek zasobów które utrzymuje (takich jak odwołania do przedmiotów lub zajęte pamięci); *nie* powinien kontynuować zwyczajnie jeśli nie jest przygotowany do obsługi błędu. Jeśli kończy z powodu błędu, istotne jest zwrócenie uwagi wołającego że został zgłoszony błąd. Jeśli błąd nie jest obsługiwany lub propagowany właściwie, dodatkowe odwołania do sprzęgu języka pytonowskiego/C mogą nie zachowywać się tak, jak planowano i mogą zawieźć w nieoczekiwane sposoby.

source: The error indicator consists of three Python objects corresponding to the result of ``sys.exc_info()``. API functions exist to interact with the error indicator in various ways. There is a separate error indicator for each thread.
pl: Wskaźnik błędu składa się z trzech przedmiotów języka pytonowskiego odpowiadających wynikowi wykonania zadania ``sys.exc_info()``. Istnieją zadania sprzęgu programowania do współpracy ze wskaźnikiem błędu na różne sposoby. Dla każdego wątku istnieje osobny wskaźnik błędu.

source: Exception Objects
pl: Przedmioty Sytuacji Wyjątkowych

source: Recursion Control
pl: Kontrola Rekursji

source: These two functions provide a way to perform safe recursive calls at the C level, both in the core and in extension modules. They are needed if the recursive code does not necessarily invoke Python code (which tracks its recursion depth automatically).
pl: Te dwa zadania dostarczają sposób postępowania dla wykonania bezpiecznego odwołania rekursywnego na poziomie języka C, zarówno w głównych jak i zewnętrznych modułach. Są one potrzebne jeśli kod odwołujący się sam do siebie nie koniecznie wywołuje kod w języku pytonowskim (który śledzi poziom zagnieżdżenia odwołań rekursywnych automatycznie).

source: Standard Exceptions
pl: Sztandarowe Sytuacje Wyjątkowe

source: All standard Python exceptions are available as global variables whose names are ``PyExc_`` followed by the Python exception name. These have the type :ctype:`PyObject\*`; they are all class objects. For completeness, here are all the variables:
pl: Wszystkie sztandarowe sytuacje wyjątkowe języka pytonowskiego są dostępne jako nadrzędne zmienne których nazwy zaczynają się od ``PyExc_`` po którym następuje nazwa sytuacji wyjątkowej języka pytonowskiego. Te są typu :ctype:`PyObject\*`; wszystkie są przedmiotami definiującymi rodzaj przedmiotu. Dla uzupełnienia, tu są wszystkie nazwy zmiennych:

source: C Name
pl: Nazwa C

source: Python Name
pl: Nazwa w języku pytonowskim

source: Notes
pl: Uwagi

source: Notes:
pl: Uwagi:

source: This is a base class for other standard exceptions.
pl: To jest podstawowy rodzaj przedmiotu dla innych sztandarowych sytuacji wyjątkowych.

source: This is the same as :exc:`weakref.ReferenceError`.
pl: To jest to samo, co sytuacja wyjątkowa :exc:`weakref.ReferenceError`.

source: Only defined on Windows; protect code that uses this by testing that the preprocessor macro ``MS_WINDOWS`` is defined.
pl: Zdefiniowane tylko w systemie Windows; Kod chroniony który używa tego przez sprawdzenie czy makrodefinicja preprocesora ``MS_WINDOWS`` jest określona.

source: File Objects
pl: Przedmioty Plikowe

source: These APIs are a minimal emulation of the Python 2 C API for built-in file objects, which used to rely on the buffered I/O (:ctype:`FILE\*`) support from the C standard library. In Python 3, files and streams use the new :mod:`io` module, which defines several layers over the low-level unbuffered I/O of the operating system. The functions described below are convenience C wrappers over these new APIs, and meant mostly for internal error reporting in the interpreter; third-party code is advised to access the :mod:`io` APIs instead.
pl: Te sprzęgi programowania (API) są najmniejszą emulacją sprzęgów zamieniających z języka pytonowskiego do języka C dla wbudowanych przedmiotów plikowych, które polegały na wsparciu wczytywania i zapisu z wyprzedzeniem (:ctype:`FILE\*`) z biblioteki sztandarowej języka C. W trzeciej wersji języka pytonowskiego pliki i strumienie używają nowego modułu :mod:`io`, który określa kilka warstw ponad niskopoziomowym niewyprzedzającym odczycie/zapisie systemu operacyjnego. Zadania opisane poniżej są konwencjonalnymi opakowaniami języka C ponad tymi nowymi sprzęgami programowania ( - z ang. - API), i służą głównie wewnętrznemu raportowaniu błędów wewnątrz programu interpretującego polecenia języka pytonowskiego; dla programów pochodzących od zewnętrznych dostawców zalecany jest dostęp przez sprzęgi programowania :mod:`io`

source: Floating Point Objects
pl: Przedmioty Liczb Zmiennopozycyjnych

source: Function Objects
pl: Przedmioty Zadań

source: There are a few functions specific to Python functions.
pl: Istnieje kilka zadań szczególnych dla zadań języka pytonowskiego

source: Supporting Cyclic Garbage Collection
pl: Wsparcie dla Cyklicznego Zbierania Śmieci

source: Python's support for detecting and collecting garbage which involves circular references requires support from object types which are "containers" for other objects which may also be containers. Types which do not store references to other objects, or which only store references to atomic types (such as numbers or strings), do not need to provide any explicit support for garbage collection.
pl: Wsparcie języka pytonowskiego dla wykrywania i zbierania śmieci które zahacza o cykliczne odwołania wymaga wsparcia od rodzajów przedmiotów, które są pojemnikami dla innych przedmiotów które mogą także być pojemnikami. Rodzaje, które nie przechowują odwołań do innych przedmiotów, lub które tylko przechowują odwołania do przedmiotów o rodzajach podstawowych (takich jak liczby lub ciągi znaków), nie potrzebują dostarczać żadnego wsparcia dla zbierania śmieci.

source: To create a container type, the :attr:`tp_flags` field of the type object must include the :const:`Py_TPFLAGS_HAVE_GC` and provide an implementation of the :attr:`tp_traverse` handler. If instances of the type are mutable, a :attr:`tp_clear` implementation must also be provided.
pl: Aby utworzyć rodzaj pojemnika, pole :attr:`tp_flags` rodzaju przedmiotu pojemnika musi zawierać :const:`Py_TPFLAGS_HAVE_GC` i dostarczać urzeczywistnienie uchwytu zadania :attr:`tp_traverse`. Jeśli egzemplarze tego rodzaju pojemników są zmienialne (mutowalne), urzeczywistnienie zadania :attr:`tp_clear` musi także być dostarczone.

source: Objects with a type with this flag set must conform with the rules documented here. For convenience these objects will be referred to as container objects.
pl: Przedmioty o rodzaju z tą flagą ustawioną muszą stosować się do zasad opisanych tutaj. Dla wygody te przedmioty te będą określane mianem przedmiotów pojemnikowych.

source: Constructors for container types must conform to two rules:
pl: Konstruktory przedmiotów typu pojemnikowego muszą stosować się do dwóch zasad:

source: The memory for the object must be allocated using :cfunc:`PyObject_GC_New` or :cfunc:`PyObject_GC_NewVar`.
pl: Pamięć dla przedmiotu musi być przydzielona używając zadania :cfunc:`PyObject_GC_New` lub :cfunc:`PyObject_GC_NewVar`.

source: Once all the fields which may contain references to other containers are initialized, it must call :cfunc:`PyObject_GC_Track`.
pl: Gdy wszystkie pola które mogą zawierać odwołania do innych pojemników zostaną zainicjowane, wtedy musi wywoływać zadanie :cfunc:`PyObject_GC_Track`.

source: Similarly, the deallocator for the object must conform to a similar pair of rules:
pl: Podobnie odbieracz przydziału dla przedmiotu musi stosować się do podobnej pary zasad:

source: Before fields which refer to other containers are invalidated, :cfunc:`PyObject_GC_UnTrack` must be called.
pl: Zanim pola które odnoszą się do innych pojemników zostaną unieważnione, zadanie :cfunc:`PyObject_GC_UnTrack` musi zostać wywołane.

source: The object's memory must be deallocated using :cfunc:`PyObject_GC_Del`.
pl: Pamięć przydzielona przedmiotowi musi zostać zabrana używając zadania :cfunc:`PyObject_GC_Del`.

source: The :attr:`tp_traverse` handler accepts a function parameter of this type:
pl: Uchwyt :attr:`tp_traverse` przyjmuje jako parametr zadania ten typ:

source: The :attr:`tp_traverse` handler must have the following type:
pl: Uchwyt :attr:`tp_traverse` musi być tego typu:

source: To simplify writing :attr:`tp_traverse` handlers, a :cfunc:`Py_VISIT` macro is provided. In order to use this macro, the :attr:`tp_traverse` implementation must name its arguments exactly *visit* and *arg*:
pl: Aby uprościć pisanie uchwytu :attr:`tp_traverse`, dostarcza się makropolecenie :cfunc:`Py_VISIT`. Aby użyć tego makropolecenia, realizacja zadania :attr:`tp_traverse` musi nazywać jego parametry dokładnie *visit* i *arg*:

source: The :attr:`tp_clear` handler must be of the :ctype:`inquiry` type, or *NULL* if the object is immutable.
pl: Uchwyt :attr:`tp_clear` musi być typu :ctype:`inquiry` (z ang. - zapytanie) lub *NULL* jeśli przedmiot jest niezmienny (niemutowalny).

source: Generator Objects
pl: Przemioty Generatorów

source: Generator objects are what Python uses to implement generator iterators. They are normally created by iterating over a function that yields values, rather than explicitly calling :cfunc:`PyGen_New`.
pl: Przedmiotów Generatorów język pytonowski używa aby realizować iteratory generatorów. Zwykle są one tworzone przez iterację po wynikach wyrzuconych z zadania, zamiast jawnie wywoływać zadanie :cfunc:`PyGen_New`.

source: Importing Modules
pl: Importowanie Modułów

source: Python/C API Reference Manual
pl: Podręcznik programowania sprzęgów między językami pyton i C

source: Release
pl: Wydanie

source: |version|
pl: |wersja|

source: Date
pl: Data

source: |today|
pl: |dzisiaj|

source: This manual documents the API used by C and C++ programmers who want to write extension modules or embed Python. It is a companion to :ref:`extending-index`, which describes the general principles of extension writing but does not document the API functions in detail.
pl: Ten podręcznik opisuje sprzęg programowania (z ang. - API) używany przez programujących w językach C i C++, którzy chcieliby pisać moduły rozszerzające lub wstawki w języku pytonowskim. Jest on uzupełnieniem sekcji :ref:`extending-index`, który opisuje ogólne zasady pisania rozszerzeń ale nie opisuje zadań sprzęgu programowania (API) w szczegółach.

source: Initialization, Finalization, and Threads
pl: Inicjalizacja, Zakańczanie i Wątki

source: Thread State and the Global Interpreter Lock
pl: Stan Wątku i Nadrzędny Zamek programu Interpretującego

source: The Python interpreter is not fully thread safe. In order to support multi-threaded Python programs, there's a global lock, called the :dfn:`global interpreter lock` or :dfn:`GIL`, that must be held by the current thread before it can safely access Python objects. Without the lock, even the simplest operations could cause problems in a multi-threaded program: for example, when two threads simultaneously increment the reference count of the same object, the reference count could end up being incremented only once instead of twice.
pl: Program interpretujący język pytonowski nie jest w pełni bezpieczny ze względu na wątki. W celu udzielenia wsparcia dla wielowątkowych programów języka pytonowskiego, istnieje nadrzędna blokada, zwana :dfn:`nadrzędną blokadą programu interpretującego` w skrócie :dfn:`GIL` (z ang. - global interpreter lock) która musi zostać wstrzymana przez aktywny wątek zanim będzie mógł korzystać bezpiecznie z przedmiotów języka pytonowskiego. Bez blokady, nawet najprostsze operacje mogłyby powodować kłopoty w wielowątkowym programie: np. gdy dwa wątki jednocześnie zwiększają liczbę odwołań do tego samego przedmiotu, liczba odwołań mogłaby ostatecznie zostać zwiększona tylko jednokrotnie zamiast dwukrotnie.

source: Therefore, the rule exists that only the thread that has acquired the global interpreter lock may operate on Python objects or call Python/C API functions. In order to support multi-threaded Python programs, the interpreter regularly releases and reacquires the lock --- by default, every 100 bytecode instructions (this can be changed with :func:`sys.setcheckinterval`). The lock is also released and reacquired around potentially blocking I/O operations like reading or writing a file, so that other threads can run while the thread that requests the I/O is waiting for the I/O operation to complete.
pl: Dlatego też, istnieje zasada mówiąca, że tylko wątek który przejął nadrzędną blokadę programu interpretującego może operować na przedmiotach języka pytonowskiego lub wzywać wykonania zadań sprzęgu programowania między językami pytonowskim i C. W celu udzielenia wsparcia dla wielowątkowych programów języka pytonowskiego, program interpretujący w równych odstępach czasu zwalnia i na powrót przejmuje blokadę --- domyślnie co 100 instrukcji w kęsokodzie (to może zostać zmienione za pomocą zadania :func:`sys.setcheckinterval`). Blokada jest także zwalniana i na powrót przejmowana wokół, potencjalnie blokowania operacji dostępu I/O, jak odczyt i zapis do pliku, tak że inne wątki mogą się toczyć podczas gdy wątek stawiający żądanie dostępu I/O (odczytu/zapisu) czeka aż operacja odczytu/zapisu zostanie zakończona.

source: The Python interpreter needs to keep some bookkeeping information separate per thread --- for this it uses a data structure called :ctype:`PyThreadState`. There's one global variable, however: the pointer to the current :ctype:`PyThreadState` structure. Before the addition of :dfn:`thread-local storage` (:dfn:`TLS`) the current thread state had to be manipulated explicitly.
pl: Program Interpretujący potrzebuje utrzymywać niektóre wiadomości porządkowe oddzielnie dla każdego wątku --- dla nich używa struktury danych zwanej :ctype:`PyThreadState`. Istnieje jednak jedna nadrzędna zmienna: wskaźnik na strukturę stanu obecnego wątku :ctype:`PyThreadState`. Przed dodaniem miejscowego magazynu wątku ( z ang. - :dfn:`thread-local storage` w skrócie :dfn:`TLS`) stan aktualnego wątku musiał być jawnie określany.

source: This is easy enough in most cases. Most code manipulating the global interpreter lock has the following simple structure::
pl: Jest to proste w większości przypadków. Większość kodu operującego na nadrzędnej blokadzie programu interpretującego ma następującą prostą budowę::

source: Save the thread state in a local variable. Release the global interpreter lock. ...Do some blocking I/O operation... Reacquire the global interpreter lock. Restore the thread state from the local variable.
pl: Zapamiętaj stan wątku w zmiennej miejscowej. Zwolnij nadrzędną blokadę programu interpretującego. ...Wykonaj pewną operację blokującą odczytu/zapisu... Na nowo przejmij i załóż nadrzędną blokadę programu interpretującego. Przywróć stan wątku ze zmiennej miejscowej.

source: This is so common that a pair of macros exists to simplify it::
pl: Jest to tak często spotykane postępowanie że istnieje para makropoleceń służąca do jego uproszczenia

source: Py_BEGIN_ALLOW_THREADS ...Do some blocking I/O operation... Py_END_ALLOW_THREADS
pl: Py_BEGIN_ALLOW_THREADS ...Wykonaj pewną blokującą odzyt/zapis operację... Py_END_ALLOW_THREADS

source: The :cmacro:`Py_BEGIN_ALLOW_THREADS` macro opens a new block and declares a hidden local variable; the :cmacro:`Py_END_ALLOW_THREADS` macro closes the block. Another advantage of using these two macros is that when Python is compiled without thread support, they are defined empty, thus saving the thread state and GIL manipulations.
pl: Makropolecenie :cmacro:`Py_BEGIN_ALLOW_THREADS` otwiera nowy blok i deklaruje ukrytą zmienną lokalną; Makropolecenie :cmacro:`Py_END_ALLOW_THREADS` zamyka blok. Dodatkową zaletą używania tych dwóch makropoleceń jest to, że gdy język pytonowski jest kompilowany bez wsparcia dla wątków, są zdefiniowane jako puste, w ten sposób zachowując stan wątków i zmiany typu GIL.

source: When thread support is enabled, the block above expands to the following code::
pl: Gdy wsparcie dla wątków jest włączone, powyższy blok rozwijany jest do poniższego kodu::

source: PyThreadState *_save; _save = PyEval_SaveThread(); ...Do some blocking I/O operation... PyEval_RestoreThread(_save);
pl: PyThreadState *_save; _save = PyEval_SaveThread(); ...Wykonaj pewne operacje blokujące wejście/wyjście... PyEval_RestoreThread(_save);

source: Using even lower level primitives, we can get roughly the same effect as follows::
pl: Używanie nawet niższego poziomu zadań podstawowych, możemy uzyskać z grubsza ten sam efekt w następujący sposób::

source: PyThreadState *_save; _save = PyThreadState_Swap(NULL); PyEval_ReleaseLock(); ...Do some blocking I/O operation... PyEval_AcquireLock(); PyThreadState_Swap(_save);
pl: PyThreadState *_save; _save = PyThreadState_Swap(NULL); PyEval_ReleaseLock(); ...Wykonaj pewną operację blokującą wejście/wyjście... PyEval_AcquireLock(); PyThreadState_Swap(_save);
